# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'
brew 'fish'

# Install Binaries
brew 'git'
brew 'pstree'
brew 'trash'
brew 'wget'
brew 'python'
brew 'go'
brew 'docker'
brew 'fontforge'
brew 'neovim'
brew 'tmux'

# Apps
cask '1password'
cask 'flux'
cask 'iterm2'
cask 'slack'
cask 'zoom'
cask 'telegram'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'rectangle'
cask 'alfred'
cask 'spotify'
cask 'firefox'
